# coding: UTF-8
'''
Created on 2014-06-10

@author: LiuYe

Desc: const defination
'''
UNDIFINED = "undifined"
# For UserIdentity Table
ADMINSTAFF_USER = "adminStaff"
SCHOOL_USER = "school"
COLLEGE_USER = "college"
EXPERT_USER = "expert"
TEACHER_USER = "teacher"
FINANCE_USER = "finance"
VISITOR_USER = "visitor"

AUTH_CHOICES = (
    (ADMINSTAFF_USER, u"管理员"),
    (SCHOOL_USER, u"学校管理员"),
    (COLLEGE_USER, u"学院管理员"),
    (TEACHER_USER, u"指导老师"),
    (EXPERT_USER, u"专家"),
    (FINANCE_USER, u"财务处"),
    (VISITOR_USER, u"游客"),
)
SCIENCE_ACTIVITY_TYPE=(
    ('0',"基础研究"),
    ('1',"应用研究"),
    ('2',"试验发展"),
    ('3',"科技服务"),
    ('4',"R&D成果应用"),
)
PROJECT_STATUS=(
  ('0',"在研"),
  ('1',"结题"),
  ('2',"终止"),
)
SEX=(
    ('0',"男"),
    ('1',"女"),
)
PROJECT_IDENTITY=(
    ('0',"教师"),
    ('1',"本科生"),
    ('2',"硕士生"),
    ('3',"博士生"),
    ('4',"博士后"),
    ('5',"其他"),
)
DEGREE=(
    ('0',"学士"),
    ('1',"硕士"),
    ('2',"博士"),
    ('3',"其他"),
)
PROFESSIONAL_TITLE=(
    ('0',"正高级"),
    ('1',"副高级"),
    ('2',"中级"),
    ('3',"其他"),
)
EXECUTIVE_POSITION=(
    ('0',"校级"),
    ('1',"院（系）级"),
    ('2',"校部（处）级"),
    ('3',"无"),
)
RESEARCH_BASES_TYPE=(
    ('0',"国家（重点）实验室"),
    ('1',"教育部重点实验室"),
    ('2',"国家文科基础学科人才培养和科学研究基地"),
    ('3',"其他省部级重点实验室"),
    ('4',"省部级以下重点实验室"),
    ('5',"无"),
)

STATICS_PRIZE_TYPE=(
    ('0',"国家级自然科学一等奖"),
    ('1',"国家级自然科学二等奖"),
    ('2',"国家级科技进步一等奖"), 
    ('3',"国家级科技进步二等奖"), 
    ('4',"国家级发明一等奖"), 
    ('5',"国家级发明二等奖"), 
    ('6',"省部级自然科学一等奖"), 
    ('7',"省部级自然科学二等奖"), 
    ('8',"省部级科技进步一等奖"),
    ('9',"省部级科技进步二等奖"), 
    ('10',"国际学术奖"), 
    ('11',"其它"),
)
STATICS_PAPER_TYPE=(
    ('0',"国际会议特邀报告"),
    ('1',"国际会议分组报告"),
    ('2',"全国性会议特邀报告"), 
    ('3',"全国性会议分组报告"), 
    ('4',"国际刊物"), 
    ('5',"国内核心刊物"), 
    ('6',"SCI"), 
    ('7',"EI"), 
    ('8',"ISTP"),
    ('9',"ISR"), 
    ('10',"中文已出版"), 
    ('11',"中文待出版"),
    ('12',"外文已出版"), 
    ('13',"外文待出版"),
)
STATICS_PATENT_TYPE=(
    ('0',"国内申请"),
    ('1',"国内批准"),
    ('2',"国外申请"), 
    ('3',"国外批准"), 
    ('4',"可推广项数"),
    ('5',"已推广项数"), 
    ('6',"经济效益（万元）"), 
    ('7',"软件/数据库"), 
    ('8',"图表/图集"), 
    ('9',"新仪器/新方法"),
    ('10',"鉴定及其它"), 
)
STATICS_SCHOLAR_TYPE=(
    ('0',"博士后在站"),
    ('1',"博士后出站"),
    ('2',"博士在读"), 
    ('3',"博士毕业"), 
    ('4',"硕士在读"),
    ('5',"硕士毕业"), 
    ('6',"中青年学术带头人(40岁以下)"), 
    ('7',"中青年学术带头人(40-50岁)"), 
    ('8',"国际次数"), 
    ('9',"国际人数"),
    ('10',"国内次数"),
    ('11',"国内人数"), 
    ('12',"出国参加国际学术会议人数次数"),
    ('13',"出国参加国际学术会议人数人数"),
)
STATICS_TYPE=(
    ('0',"获奖（项）"),
    ('1',"专著／论文（篇）"),
    ('2',"专利及其它"), 
    ('3',"人才培养及学术交流"), 
)

ACHIVEMENT_TYPE=(
    ('0',"专著"),
    ('1',"期刊论文"),
    ('2',"会议论文"), 
    ('3',"专利"), 
    ('4',"获奖"),
    ('5',"其他"), 
)






