# coding: UTF-8
'''
Created on 2014-06-10

@author: LiuYe

Desc: const defination
'''
UNDIFINED = "undifined"
# For UserIdentity Table
ADMINSTAFF_USER = "adminStaff"
SCHOOL_USER = "school"
COLLEGE_USER = "college"
EXPERT_USER = "expert"
TEACHER_USER = "teacher"
FINANCE_USER = "finance"
VISITOR_USER = "visitor"

AUTH_CHOICES = (
    (ADMINSTAFF_USER, u"管理员"),
    (SCHOOL_USER, u"专题管理员"),
    (COLLEGE_USER, u"学院管理员"),
    (TEACHER_USER, u"指导老师"),
    (EXPERT_USER, u"专家"),
    (FINANCE_USER, u"财务处"),
    (VISITOR_USER, u"游客"),
)
#Science Activity Type
NOTICE_CHOICE=(
    ('0',"全部"),
    ('1',"专家"),
    ('2',"学院"),
    ('3',"教师"),
)

SCIENCE_ACTIVITY_TYPE_CHOICES=(
    ('0',u"基础研究"),
    ('1',u"应用研究"),
    ('2',u"试验发展"),
    ('3',u"科技服务"),
    ('4',u"R&D成果应用"),
)
PROJECT_STATUS_CHOICES=(
  ('0',"在研"),
  ('1',"结题"),
  ('2',"终止"),
)
SEX_CHOICES=(
    ('0',"男"),
    ('1',"女"),
)
PROJECT_IDENTITY_CHOICES=(
    ('0',"教师"),
    ('1',"本科生"),
    ('2',"硕士生"),
    ('3',"博士生"),
    ('4',"博士后"),
    ('5',"其他"),
)
DEGREE_CHOICES=(
    ('0',"学士"),
    ('1',"硕士"),
    ('2',"博士"),
    ('3',"其他"),
)
PROFESSIONAL_TITLE_CHOICES =(
    ('0',"正高级"),
    ('1',"副高级"),
    ('2',"中级"),
    ('3',"其他"),
)
EXECUTIVE_POSITION_CHOICES=(
    ('0',"校级"),
    ('1',"院（系）级"),
    ('2',"校部（处）级"),
    ('3',"无"),
)
RESEARCH_BASES_TYPE_CHOICES=(
    ('0',"国家（重点）实验室"),
    ('1',"教育部重点实验室"),
    ('2',"国家文科基础学科人才培养和科学研究基地"),
    ('3',"其他省部级重点实验室"),
    ('4',"省部级以下重点实验室"),
    ('5',"无"),
)

STATICS_DATA_TYPE=(
    ('0',"国家级自然科学一等奖"),
    ('1',"国家级自然科学二等奖"),
    ('2',"国家级科技进步一等奖"), 
    ('3',"国家级科技进步二等奖"), 
    ('4',"国家级发明一等奖"), 
    ('5',"国家级发明二等奖"), 
    ('6',"省部级自然科学一等奖"), 
    ('7',"省部级自然科学二等奖"), 
    ('8',"省部级科技进步一等奖"),
    ('9',"省部级科技进步二等奖"), 
    ('10',"国际学术奖"), 
    ('11',"其它"),
    ('12',"国际会议特邀报告"),
    ('13',"国际会议分组报告"),
    ('14',"全国性会议特邀报告"), 
    ('15',"全国性会议分组报告"), 
    ('16',"国际刊物"), 
    ('17',"国内核心刊物"), 
    ('18',"SCI"), 
    ('19',"EI"), 
    ('20',"ISTP"),
    ('21',"ISR"), 
    ('22',"中文已出版"), 
    ('23',"中文待出版"),
    ('24',"外文已出版"), 
    ('25',"外文待出版"),
    ('26',"国内申请"),
    ('27',"国内批准"),
    ('28',"国外申请"), 
    ('29',"国外批准"), 
    ('30',"可推广项数"),
    ('31',"已推广项数"), 
    ('32',"经济效益（万元）"), 
    ('33',"软件/数据库"), 
    ('34',"图表/图集"), 
    ('35',"新仪器/新方法"),
    ('36',"鉴定及其它"),
    ('37',"博士后在站"),
    ('38',"博士后出站"),
    ('39',"博士在读"), 
    ('40',"博士毕业"), 
    ('41',"硕士在读"),
    ('42',"硕士毕业"), 
    ('43',"中青年学术带头人(40岁以下)"), 
    ('44',"中青年学术带头人(40-50岁)"), 
    ('45',"国际次数"), 
    ('46',"国际人数"),
    ('47',"国内次数"),
    ('48',"国内人数"), 
    ('49',"出国参加国际学术会议人数次数"),
    ('50',"出国参加国际学术会议人数人数"), 
)

STATICS_TYPE=(
    ('0',"获奖（项）"),
    ('1',"专著／论文（篇）"),
    ('2',"专利及其它"), 
    ('3',"人才培养及学术交流"), 
)

ACHIVEMENT_TYPE=(
    ('0',"专著"),
    ('1',"期刊论文"),
    ('2',"会议论文"), 
    ('3',"专利"), 
    ('4',"获奖"),
    ('5',"其他"),

)






